# i = (int)(input("정수를 입력하세요: "))

# if (i % 2 == 0) :
#     print("입력한 정수는 짝수 입니다.")
#     print("sd")
# else :
#     print("입력한 정수는 홀수 입니다.")

#############################################################################################

# id = ["hong", "kim", "tae"]
# pw = 12345678
# input_id = input("아이디를 입력하세요: ")

# if (input_id in id) :
#     input_pw = (int)(input("패스워드를 입력하세요: "))    
#     if (pw == input_pw) :
#         print("환영합니다!")
#     else :
#         print("패스워드가 틀렸습니다.")
# else :
#     print("아이디가 틀렸습니다.")

###############################################################################################

# age = (int)(input("나이가 몇살 인가요? "));
# height = (int)(input("키는 몇인가요? "));

# if (age >= 10 & height >= 165):
#     print("탑승 가능!")
# else :
#     print("탑승 불가능!");

###############################################################################################








